# 6. DATABASES AND SQL FOR DATA SCIENCE WITH PYTHON

## Table of Contents
1. [Module 1: Getting Started with SQL](#module-1)
2. [Module 2: Introduction to Relational Databases and Tables](#module-2)
3. [Module 3: Intermediate SQL](#module-3)
4. [Module 4: ](#module-4)
5. [Module 5: ](#module-5)
6. [Module 6: ](#module-6)

# 6.1. Getting Started with SQL <a id="module-1"></a>

## 6.1.1. Basic SQL

### 6.1.1.1. Introduction to Databases

* **SQL (Structured Query Language)** is a language used to interact with relational databases. It allows you to perform tasks like querying data, adding data, modifying data, and defining database structures.
* **Data** is a collection of facts, which can be in the form of words, numbers, or even pictures. Data is a valuable asset for businesses and organizations.
* **Database** is a program that stores data and provides functionalities for adding, modifying, and querying that data. Databases help keep data secure, organized, and easily accessible.
* **Relational database** is a type of database that organizes data into tables with rows and columns, similar to a spreadsheet. Tables can be related to each other based on common fields.
* **RDBMS (Relational Database Management System)** is a set of software tools that control the data in a relational database, including access, organization, and storage. They are used in various industries like banking, transportation, and healthcare. Examples of RDBMS include MySQL, Oracle Database, DB2 Warehouse, and DB2 on Cloud.
* **5 basic SQL commands:**  
    * `CREATE TABLE`: Creates a new table in the database.
    * `INSERT`: Adds data into a table.
    * `SELECT`: Retrieves data from a table.
    * `UPDATE`: Modifies existing data in a table.
    * `DELETE`: Removes data from a table.

### 6.1.1.2. `SELECT` Statement

* `SELECT` statement is the primary command in SQL. It's used to retrieve data from a database table. It's a Database Manipulation Language (DML) statement that allows you to specify which columns and rows you want to retrieve.
* A Database Management System (DBMS) not only stores data but also provides tools for retrieving and manipulating that data. The `SELECT` statement is a key tool for data retrieval.
* A `SELECT` statement is often called a **query**, and the output it produces is called a **result set** or **result table**.
* **Basic Syntax:**
    * `SELECT * FROM table_name;`: Retrieves all columns and all rows from the specified table.
    * `SELECT column1, column2 FROM table_name;`: Retrieves only the specified columns from the table.
* **Comparison operators** used in predicates to compare values:
    * `=`: Equal to
    * `>`: Greater than
    * `<`: Less than
    * `>=`: Greater than or equal to
    * `<=`: Less than or equal to
    * `<>` or `!=`: Not equal to
* **Example:** `SELECT title FROM book WHERE book_id = 'B1;`: Retrieves the title of the book with the ID 'B1'

### 6.1.1.3. `COUNT`, `DISTINCT`, and `LIMIT` Functions

* `COUNT()` is a function that retrieves the number of rows that match the specified criteria.
    * `COUNT(*)` counts all rows in a table. For example, `SELECT COUNT(*) FROM employees;` counts all rows in the "employees" table.
    * `COUNT(column_name)` counts the number of non-null values in a specific column. For example, `SELECT COUNT(city) from customers;` counts the number of non-values in the "city" column of the "customers" table.
* `DISTINCT` is used to remove duplicate values from a result set, returning only unique values.  For example, `SELECT DISTINCT country FROM customers;` retrieves a list of unique countries from the "country" column of the "customers" table.
* `LIMIT` restricts the number of rows returned by a query, which is useful for previewing data or working with large datasets. For example, `SELECT * FROM products LIMIT 10;` retrieves the first 10 rows from the "products" table. If you use `SELECT * FROM FilmLocations LIMIT 15 OFFSET 10;` the results start from row 11, leaving the first 10 row aside.

### 6.1.1.4. `INSERT` Statement

* `INSERT` statement is used to add new rows to a table in a relational database. The syntax is:
    * `INSERT INTO table_name (column_name1, column_name2, ...) VALUES (value1, value2, ...);`
* We can also add multiple rows at a time:
    * `INSERT INTO table_name (column_name1, column_name2, ...) VALUES (value1_for_row1, value2_for_row1, ...), (value1_for_row2, value2_for_row2, ...);`
* **Important Considerations:**
    * The number of values in the `VALUES` clause must match the number of column names specified.
    * If the column names are omitted, the values must be in the same order as the columns defined in the table.
    * If a column is not specified in the `column_name` list, its value will be set to NULL (missing value)

### 6.1.1.5. `UPDATE` and `DELETE` Statements

* **`UPDATE` statement** is used to modify existing data in a table. The syntax is:
    * `UPDATE table_name SET column_name1 = value 1, column_name2 = value2, ... WHERE condition;`
    * `table_name` is the name of the table you want to update
    * `SET` specifies the columns to be updated and their new values
    * `WHERE` specifies which rows to update. If omitted, all rows will be updated.
    * Example: `UPDATE authors SET last_name='Katta', first_name='Lakshmi' WHERE author_id='A2';` updates the last and first names of the author with the ID 'A2'.

* **`DELETE` statement** is used to remove rows from a table. The syntax is:
    * `DELETE FROM table_name WHERE condition`
    * Example: `DELETE FROM authors WHERE author_id IN ('A2', 'A3')` deletes rows with author IDs 'A2' and 'A3'

# 6.2. Introduction to Relational Databases and Tables <a id="module-2"></a>

## 6.2.1. Introduction to Relational Databases and Tables

### 6.2.1.1. Relational Database Concepts

* **Relational model and data independence:** The relational model is widely used for databases because it provides data independence. This means that the way data is stored and accessed is independent of the way it is used by applications. This offers flexibility and easier maintenance.
* **Entity-Relationship (ER) Model:** An alternative to the relational model, the ER model is often used as a tool to design relational databases. It represents data as entities (objects) and their relationships.
* **Entities and attributes:**  
    * **Entities:** Represent real-world objects or concepts (e.g., book, author, borrower). In an ER diagram, they are represented as triangles.
    * **Attributes:** Characteristics or properties of an entity (e.g., book title, author's name, borrower's address). In an ER diagram, they are represented as ovals.
* **Mapping entities and attributes to tables and columns:**  In a relational database, entities become tables, and attributes become columns within those tables.
* **Data types:**  Each column has a specific data type that defines the kind of value it can store. Common data types include:
    * Characters (`CHAR`, `VARCHAR`) for storing text.
    * Numbers (`INTEGER`, `DECIMAL`) for storing numerical values.
    * Timestamps (`DATE`, `TIME`) for storing dates and times.
* **Primary key** is a column or set of columns that uniquely identifies each row in a table. It prevents duplicate data and is crucial for establishing relationships between databases.
* **Foreign key** is a column that refers to the primary key of another table, creating a link between the two tables.

### 6.2.1.2. Types of SQL Statements (DDL vs. DML)

**SQL statements**, commands used to interact with databases, are categorized into two types:

1. **Data Definition Language (DDL) Statements:** Used to define, change, or drop database objects like tables:
    * `CREATE`: Creates tables and defines their columns.
    * `ALTER`: Modifies existing tables (adding, dropping, or modifying columns).
    * `TRUNCATE`: Deletes all data from a table but keeps the data structure. 
    * `DROP`: Deletes tables.
2. **Data Manipulation Language (DML) Statements:** Used to read and modify data within tables. Also known as CRUD (Create, Read, Update, Delete) Operations.
    * `INSERT`: Adds new rows of data to a table.
    * `SELECT`: Reads or retrieves data from a table.
    * `UPDATE`: Modifies existing data in a table.
    * `DELETE`: Removes rows of data from a table.

### 6.2.1.3. `CREATE TABLE` Statement

* `CREATE TABLE` is a DDL (Data Definition Language) statement used to create tables in a relational database. The syntax is:  
`CREATE TABLE table_name (`    
&nbsp;&nbsp;&nbsp;&nbsp;`column_name1 datatype constraints,`  
&nbsp;&nbsp;&nbsp;&nbsp;`column_name2 datatype constraints,`  
&nbsp;&nbsp;&nbsp;&nbsp;`...`  
&nbsp;&nbsp;&nbsp;&nbsp;`);`
* Example:  
`CREATE TABLE author (`  
&nbsp;&nbsp;&nbsp;&nbsp;`author_id CHAR(2) PRIMARY KEY NOT NULL,`  
&nbsp;&nbsp;&nbsp;&nbsp;`lastname VARCHAR(15) NOT NULL,`  
&nbsp;&nbsp;&nbsp;&nbsp;`firstname VARCHAR(15) NOT NULL,`  
&nbsp;&nbsp;&nbsp;&nbsp;`email VARCHAR(40),`  
&nbsp;&nbsp;&nbsp;&nbsp;`city VARCHAR(15),`  
&nbsp;&nbsp;&nbsp;&nbsp;`country CHAR(2)`  
&nbsp;&nbsp;&nbsp;&nbsp;`);`

### 6.2.1.4. `ALTER`, `DROP` and `TRUNCATE` Tables

* **`ALTER TABLE` Statement** is used to modify the structure of an existing table. `ADD COLUMN` adds a new column to the table. `MODIFY COLUMN` changes the data type or constraints of an existing column. `DROP COLUMN` removes a column from the table. Syntax:  
    &nbsp;&nbsp;&nbsp;&nbsp;`ALTER TABLE table_name`  
    &nbsp;&nbsp;&nbsp;&nbsp;`ADD COLUMN column_name datatype constraints,`  
    &nbsp;&nbsp;&nbsp;&nbsp;`MODIFY COLUMN column_name datatype constraints,`    
    &nbsp;&nbsp;&nbsp;&nbsp;`DROP COLUMN column_name,`  
    &nbsp;&nbsp;&nbsp;&nbsp;`...;`  
* **`DROP TABLE` Statement** is used to delete an entire table from the database. Syntax:  
    &nbsp;&nbsp;&nbsp;&nbsp;`DROP TABLE table_name;`
* **`TRUNCATE TABLE` Statement** is used to delete all rows from a table while keeping the table structure intact. Syntax:  
    &nbsp;&nbsp;&nbsp;&nbsp;`TRUNCATE TABLE table_name IMMEDIATE;`

# 6.3. Intermediate SQL <a id="module-3"></a>

## 6.3.1. Refining Your Results

### 6.3.1.1. Using String Patterns and Ranges

* **String Patterns with `LIKE`:**
    * The `LIKE` predicate allows you to search for patterns in string data.
    * Wildcard characters:
        * `%`: Matches any sequence of zero or more characters.
        * `_`: Matches any single character.
    * Example: `SELECT first_name FROM author WHERE first_name LIKE 'R%';` finds authors whose name starts with the letter 'R'
* **Ranges with `BETWEEN ... AND`:**
    * The `BETWEEN ... AND` operator allows you to specify a range of values. The values are inclusive.
    * Example: `SELECT * FROM book WHERE pages BETWEEN 290 AND 300;` finds books with pages between 290 and 300, both inclusive.
* **Sets of Values with `IN`:**
    * The `IN` operator allows you to specify multiple values in a condition.
    * Example: `SELECT * FROM author WHERE country IN ('AU', 'BR', 'CA');` finds authors from the listed countries.

### 6.3.1.2. Sorting Result Sets: `ORDER BY`

* **Sorting Order:**  
    * `ORDER BY` clause sorts values in ascending order (from lowest to highest for numbers, alphabetically for strings) by default.
    * Use `DESC` to sort in descending order.
* **Specifying sort column:**  
    * You can specify the column to sort by using its name or its position in the `SELECT` statement.
    * Example: `SELECT * FROM books ORDER BY title` sorts by the 'title' column.
    * Example: `SELECT title, pages FROM books ORDER BY 2` sorts by the 'pages' column because its the 2nd column in the `SELECT` statement.
* **Sorting by multiple columns:**  
    * You can sort by multiple columns by separating them with commas in the `ORDER BY` clause.
    * Example: `ORDER BY last_name, first_name` sorts first by last name, then by first name within the each last name group.

### 6.3.1.3. Grouping Result Sets

* **`DISTINCT`** is used to eliminate duplicate rows from a result set, returning only unique values.
    * Example: `SELECT DISTINCT country FROM author;` returns only the unique country codes from the author table.
* **`GROUP BY` clause** groups rows with the same values in one or more columns, allowing you to perform aggregate functions (such as `COUNT()`, `SUM()`, `AVG()`) on each group.
    * Example: `SELECT country, COUNT(country) FROM author GROUP BY country;` counts the number of authors from each country.
* **`AS` keyword** is used to assign a custom name (alias) to a column in the results set.
    * Example: `SELECT country, COUNT(country) AS num_authors FROM author GROUP BY country;` country the number of authors from each country while changing the second column name of the result set to 'num_authors'
* **`HAVING` clause** is used to filter grouped data based on a condition. It's similar to the `WHERE` clause but applies to groups instead of individual rows.
    * Example: `SELECT country, COUNT(country) AS num_authors FROM author GROUP BY country HAVING num_authors > 4` returns only countries with more than 4 authors.

## 6.3.2. Functions, Multiple Tables, and Sub-queries

### 6.3.2.1 Built-in Database Functions

* **Built-in database functions** are pre-defined within the database management system (DBMS) to perform operations on data directly within the database.
* **Advantages of using built-in functions:**
    * Reduce network traffic and bandwidth usage by performing operations within the database.
    * Potentially faster execution, especially for large datasets.
* **Types of built-in functions:**
    * **Aggregate functions (column functions)** take a collection of values as input and return a single value.
        * `SUM()`: Calculates the sum of values in a column.
        * `MIN()`: Returns the minimum value in a column.
        * `MAX()`: Returns the maximum value in a column.
        * `AVG()`: Calculates the average (mean) value in a column.
    * **Scalar functions** operate on individual values.
        * `ROUND()`: Rounds a numerical value to a specified number of decimal places.
        * `LENGTH()`: Returns the length of a string.
        * `UCASE()`: Converts a string to uppercase.
        * `LCASE()`: Converts a string to lowercase.

* **Using functions in queries:**
    * You can use functions in the `SELECT` statement to calculate values directly from data. You can also use functions in the `WHERE` clause to filter data based on conditions involving function results.
    * Examples: 
        * `SELECT SUM(COST) AS total_cost FROM PETRESCUE;` calculates the sum of the "COST" column and names it "total_cost"
        * `SELECT AVG(COST / QUANTITY) FROM PETRESCUE WHERE ANIMAL = 'Dog';` calculates the average cost per dog.
        * `SELECT * FROM PETRESCUE WHERE LOWERCASE(ANIMAL) = 'cat';` retrieves rows where the lowercase of the 'ANIMAL' column is 'cat'. Useful when you're not sure is the values have the same upper/lowercase standard.

### 6.3.2.2. Date and Time Built-in Functions

* SQL has specific data types for storing dates and times:
    * `DATE`: Stores year, month, and day (YYYY-MM-DD)
    * `TIME`: Stores hour, minute, and second (HH:MM:SS)
    * `TIMESTAMP`: Stores date and time with microsecond precision (YYYY-MM-DD HH:MM:SS.ffffff)
* **Date and time functions:** SQL provides built-in function to extract or manipulate date and time values.
    * **Extracting functions:**  
        * `DAY()`: Extracts the day of the month from a date or timestamp.
        * `MONTH()`: Extract the month from a date or timestamp.
        * `YEAR()`: Extracts the year from a date or timestamp.
        * `DAYOFWEEK()`: Returns the day of the week (1-7, Sunday-Saturday) from a date or timestamp.
        * `HOUR()`: Extracts the hour from a time or timestamp.
        * `MINUTE()`: Extracts the minute from a time or timestamp.
        * `SECOND()`: Extracts the second from a time of timestamp.
    * **Date/Time arithmetics:**  
        * `DATE_ADD()`: Adds a specified interval to a date or timestamp.
        * `DATE_SUB()`: Subtracts a specified interval from a date or timestamp.
    * **Special registers:**  
        * `CURRENT_DATE()`: Returns the current date.
        * `CURRENT_TIME()`: Returns the current time.
    * **Examples:**  
        * `SELECT DAY(rescue_date) FROM petrescue WHERE animal = 'Cat';` extracts the day of the month from the "rescue_date" column for rows where "animal" is "Cat".
        * `SELECT COUNT(*) FROM petrescue WHERE MONTH(rescue_date) = 5;` counts the number of rescues in the month of May.
        * `SELECT DATE_ADD(rescue_date, INTERVAL 3 DAY) FROM petrescue;` calculates the date three days after each rescuea date.
        * `SELECT CURRENT_DATE - rescue_date FROM petrescue;` calculates the difference in days between the current date and each rescue date.

### 6.3.2.3. Sub-Queries and Nested Selects

* **Subqueries (Nested SELECT Statements)** are regular SQL queries embedded within another query, enclosed in parenthesis. They allow you to create more complex and powerful queries.
* **Types of subqueries:**
    1. **In the `WHERE` clause:** Used to filter data based on the results of another query. Example: `SELECT * FROM employees WHERE salary > (SELECT AVG(salary) FROM employees);` Finds employees with above-average salaries.
    2. **Column expressions:** Used to include the result of a subquery as a column in the main query's result set. Example: `SELECT employee_id, salary, (SELECT AVG(salary) FROM employees) AS average_salary FROM employees;` shows each employee's salary alongside the average salary.
    3. **Derived tables:** The subquery acts as a temporary table that the main query can use. Example: `SELECT * FROM (SELECT employee_id, first_name, last_name FROM employees) AS non_sensitive_employees;` creates a derived table with only non-sensitive employee information.
* **Benefits of subqueries:**
    * Enable more complex filtering and data retrieval.
    * Can overcome limitations of using aggregate functions directly in certain clauses (e.g., `WHERE` clause).
    * Allow for modularity and code reusability by breaking down complex queries into smaller manageable parts.